cask_args appdir: '/Applications'

# Tap it
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# Cask it
cask 'firefox'
cask 'rectangle'

# Brewwwwww
brew 'postgresql'
brew 'redis'

brew 'pyenv'
brew 'pyenv-virtualenv'

brew 'go'
brew 'fzf'
brew 'glow'

brew 'fd'
brew 'ripgrep'
brew 'exa'

brew 'tmux'
brew 'wget'

brew 'gawk'
brew 'htop'
brew 'gpg'

brew 'exercism'

brew 'tree-sitter', args: ['HEAD']
brew 'luajit', args: ['HEAD']
brew 'vim'
brew 'neovim', args: ['HEAD']

